; domain
(define (domain parking)
 (:requirements :strips :typing :action-costs)
 (:types car curb)
 (:predicates 
    (at-curb ?car - car) 
    (at-curb-num ?car - car ?curb - curb)
    (behind-car ?car ?front-car - car)
    (car-clear ?car - car) 
    (curb-clear ?curb - curb)
 )


	(:action move-curb-to-curb
		:parameters (?car - car ?curbsrc ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(at-curb-num ?car ?curbsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(curb-clear ?curbsrc)
			(at-curb-num ?car ?curbdest)
			(not (at-curb-num ?car ?curbsrc))
                        (increase (total-cost) 1)
		)
	)

	(:action move-curb-to-car
		:parameters (?car - car ?curbsrc - curb ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(at-curb-num ?car ?curbsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(curb-clear ?curbsrc)
			(behind-car ?car ?cardest)
			(not (at-curb-num ?car ?curbsrc))
			(not (at-curb ?car))
                        (increase (total-cost) 1)
		)
	)

	(:action move-car-to-curb
		:parameters (?car - car ?carsrc - car ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(behind-car ?car ?carsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(car-clear ?carsrc)
			(at-curb-num ?car ?curbdest)
			(not (behind-car ?car ?carsrc))
			(at-curb ?car)
                        (increase (total-cost) 1)
		)
	)

	(:action move-car-to-car
		:parameters (?car - car ?carsrc - car ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(behind-car ?car ?carsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(car-clear ?carsrc)
			(behind-car ?car ?cardest)
			(not (behind-car ?car ?carsrc))
                        (increase (total-cost) 1)
		)
	)
)

; problem
(define   (problem parking)
  (:domain parking)
  (:objects
     car_0  car_1  car_2  car_3  car_4  car_5  car_6  car_7  car_8  car_9 - car
     curb_00 curb_01 curb_02 curb_03 curb_04 curb_05 curb_06 curb_07 curb_08 curb_09 curb_10 curb_11 curb_12 curb_13 curb_14 curb_15 - curb
  )
  (:init
    (at-curb car_4)
    (at-curb-num car_4 curb_00)
    (behind-car car_8 car_4)
    (car-clear car_8)
    (at-curb car_2)
    (at-curb-num car_2 curb_01)
    (behind-car car_9 car_2)
    (car-clear car_9)
    (at-curb car_1)
    (at-curb-num car_1 curb_02)
    (behind-car car_0 car_1)
    (car-clear car_0)
    (at-curb car_6)
    (at-curb-num car_6 curb_03)
    (behind-car car_7 car_6)
    (car-clear car_7)
    (at-curb car_5)
    (at-curb-num car_5 curb_04)
    (behind-car car_3 car_5)
    (car-clear car_3)
    (curb-clear curb_05)
    (curb-clear curb_06)
    (curb-clear curb_07)
    (curb-clear curb_08)
    (curb-clear curb_09)
    (curb-clear curb_10)
    (curb-clear curb_11)
    (curb-clear curb_12)
    (curb-clear curb_13)
    (curb-clear curb_14)
    (curb-clear curb_15)
  )
  (:goal
    (and
      (at-curb-num car_0 curb_00)
      (at-curb-num car_1 curb_01)
      (at-curb-num car_2 curb_02)
      (at-curb-num car_3 curb_03)
      (at-curb-num car_4 curb_04)
      (at-curb-num car_5 curb_05)
      (at-curb-num car_6 curb_06)
      (at-curb-num car_7 curb_07)
      (at-curb-num car_8 curb_08)
      (at-curb-num car_9 curb_09)
    )
  )

)
; =========== INIT =========== 
;  curb_00: car_4 car_8 
;  curb_01: car_2 car_9 
;  curb_02: car_1 car_0 
;  curb_03: car_6 car_7 
;  curb_04: car_5 car_3 
;  curb_05: 
;  curb_06: 
;  curb_07: 
;  curb_08: 
;  curb_09: 
;  curb_10: 
;  curb_11: 
;  curb_12: 
;  curb_13: 
;  curb_14: 
;  curb_15: 
; ========== /INIT =========== 

; =========== GOAL =========== 
;  curb_00: car_0 
;  curb_01: car_1 
;  curb_02: car_2 
;  curb_03: car_3 
;  curb_04: car_4 
;  curb_05: car_5 
;  curb_06: car_6 
;  curb_07: car_7 
;  curb_08: car_8 
;  curb_09: car_9 
;  curb_10: 
;  curb_11: 
;  curb_12: 
;  curb_13: 
;  curb_14: 
;  curb_15: 
; =========== /GOAL ===========

; plan
1. (move-car-to-curb car_0 car_1 curb_05)
   deleted: (curb-clear curb_05) (behind-car car_0 car_1)
   added: (car-clear car_1) (at-curb-num car_0 curb_05) (at-curb car_0)
   goals met: 0 of 10
2. (move-car-to-curb car_7 car_6 curb_07)
   deleted: (curb-clear curb_07) (behind-car car_7 car_6)
   added: (car-clear car_6) (at-curb-num car_7 curb_07) (at-curb car_7)
   goals met: 1 of 10
3. (move-curb-to-curb car_6 curb_03 curb_06)
   deleted: (curb-clear curb_06) (at-curb-num car_6 curb_03)
   added: (curb-clear curb_03) (at-curb-num car_6 curb_06)
   goals met: 2 of 10
4. (move-car-to-curb car_3 car_5 curb_03)
   deleted: (curb-clear curb_03) (behind-car car_3 car_5)
   added: (car-clear car_5) (at-curb-num car_3 curb_03) (at-curb car_3)
   goals met: 3 of 10
5. (move-car-to-curb car_8 car_4 curb_08)
   deleted: (curb-clear curb_08) (behind-car car_8 car_4)
   added: (car-clear car_4) (at-curb-num car_8 curb_08) (at-curb car_8)
   goals met: 4 of 10
6. (move-car-to-curb car_9 car_2 curb_09)
   deleted: (curb-clear curb_09) (behind-car car_9 car_2)
   added: (car-clear car_2) (at-curb-num car_9 curb_09) (at-curb car_9)
   goals met: 5 of 10
7. (move-curb-to-car car_1 curb_02 car_3)
   deleted: (car-clear car_3) (at-curb-num car_1 curb_02) (at-curb car_1)
   added: (curb-clear curb_02) (behind-car car_1 car_3)
   goals met: 5 of 10
8. (move-curb-to-curb car_2 curb_01 curb_02)
   deleted: (curb-clear curb_02) (at-curb-num car_2 curb_01)
   added: (curb-clear curb_01) (at-curb-num car_2 curb_02)
   goals met: 6 of 10
9. (move-curb-to-car car_4 curb_00 car_2)
   deleted: (car-clear car_2) (at-curb-num car_4 curb_00) (at-curb car_4)
   added: (curb-clear curb_00) (behind-car car_4 car_2)
   goals met: 6 of 10
10. (move-curb-to-curb car_0 curb_05 curb_00)
   deleted: (curb-clear curb_00) (at-curb-num car_0 curb_05)
   added: (curb-clear curb_05) (at-curb-num car_0 curb_00)
   goals met: 7 of 10
11. (move-curb-to-curb car_5 curb_04 curb_05)
   deleted: (curb-clear curb_05) (at-curb-num car_5 curb_04)
   added: (curb-clear curb_04) (at-curb-num car_5 curb_05)
   goals met: 8 of 10
12. (move-car-to-curb car_1 car_3 curb_01)
   deleted: (curb-clear curb_01) (behind-car car_1 car_3)
   added: (car-clear car_3) (at-curb-num car_1 curb_01) (at-curb car_1)
   goals met: 9 of 10
13. (move-car-to-curb car_4 car_2 curb_04)
   deleted: (curb-clear curb_04) (behind-car car_4 car_2)
   added: (car-clear car_2) (at-curb-num car_4 curb_04) (at-curb car_4)
   goals met: 10 of 10
